In [3]:
#Python Warning off
import warnings
warnings.filterwarnings('ignore')

#TF warning off
import tensorflow as tf
tf.compat.v1.logging.set_verbosity(tf.compat.v1.logging.ERROR)

In [1]:
#성적 프로그램 
%matplotlib inline
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import scipy.stats as stats #통계

C:\Users\User\anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\Users\User\anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\Users\User\anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)
C:\Users\User\anaconda3\lib\importlib\_bootstrap.py:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
  return f(*args, **kwds)

In [4]:
df = pd.read_csv('datasets/score.csv')
df

    반   이름   국어  영어  수학  과학
0   1  성춘향   67  87  90  98
1   1  이몽룡   45  45  56  98
2   1  향단이   95  59  96  88
3   1   방자   65  94  89  98
4   1   월매   45  65  78  98
5   1  변학도   78  76  98  89
6   2  홍길동   87  67  65  56
7   2  임꺽정   89  98  78  78
8   2  전우치  100  78  56  65
9   2  일지매   99  89  87  87
10  2   심청   98  45  56  54
11  2   콩쥐   65  89  87  78

In [7]:
subjects=['국어','영어','수학','과학']

In [8]:
df['총점']=df[subjects].sum(axis=1) #subjects 자리에 list가 들어감
df

    반   이름   국어  영어  수학  과학   총점
0   1  성춘향   67  87  90  98  342
1   1  이몽룡   45  45  56  98  244
2   1  향단이   95  59  96  88  338
3   1   방자   65  94  89  98  346
4   1   월매   45  65  78  98  286
5   1  변학도   78  76  98  89  341
6   2  홍길동   87  67  65  56  275
7   2  임꺽정   89  98  78  78  343
8   2  전우치  100  78  56  65  299
9   2  일지매   99  89  87  87  362
10  2   심청   98  45  56  54  253
11  2   콩쥐   65  89  87  78  319

In [11]:
 df['평균'] = df['총점']/len(subjects) #과목 리스트만 수정해주면 평균도 바뀜
df

    반   이름   국어  영어  수학  과학   총점     평균
0   1  성춘향   67  87  90  98  342  85.50
1   1  이몽룡   45  45  56  98  244  61.00
2   1  향단이   95  59  96  88  338  84.50
3   1   방자   65  94  89  98  346  86.50
4   1   월매   45  65  78  98  286  71.50
5   1  변학도   78  76  98  89  341  85.25
6   2  홍길동   87  67  65  56  275  68.75
7   2  임꺽정   89  98  78  78  343  85.75
8   2  전우치  100  78  56  65  299  74.75
9   2  일지매   99  89  87  87  362  90.50
10  2   심청   98  45  56  54  253  63.25
11  2   콩쥐   65  89  87  78  319  79.75

In [18]:
df2=df.sort_values(['평균','이름'], ascending = [False,True] ) #ascending True면 오름차순(작은것 부터)
#평균으로 내림차순, 이름으로 오름차순
df2

    반   이름   국어  영어  수학  과학   총점     평균
9   2  일지매   99  89  87  87  362  90.50
3   1   방자   65  94  89  98  346  86.50
7   2  임꺽정   89  98  78  78  343  85.75
0   1  성춘향   67  87  90  98  342  85.50
5   1  변학도   78  76  98  89  341  85.25
2   1  향단이   95  59  96  88  338  84.50
11  2   콩쥐   65  89  87  78  319  79.75
8   2  전우치  100  78  56  65  299  74.75
4   1   월매   45  65  78  98  286  71.50
6   2  홍길동   87  67  65  56  275  68.75
10  2   심청   98  45  56  54  253  63.25
1   1  이몽룡   45  45  56  98  244  61.00